package com.mk.mkfighterresultdb;

public class Constants {
    private Constants() {
    }

    public static String DB_NAME = "fighter_result_db";
    public static String HERO_NAME_1 = "Бо'Рай Чо";
    public static String HERO_NAME_2 = "Горо";
    public static String HERO_NAME_3 = "Джакс";
    public static String HERO_NAME_4 = "Джейсон Вурхиз";
    public static String HERO_NAME_5 = "Джеки Бриггс";
    public static String HERO_NAME_6 = "Джонни Кейдж";
    public static String HERO_NAME_7 = "Ди'Вора";
    public static String HERO_NAME_8 = "Кано";
    public static String HERO_NAME_9 = "Кенши";
    public static String HERO_NAME_10 = "Китана";
    public static String HERO_NAME_11 = "Кожаное лицо";
    public static String HERO_NAME_12 = "Коталь Кан";
    public static String HERO_NAME_13 = "Куан Чи";
    public static String HERO_NAME_14 = "Кунг Джин";
    public static String HERO_NAME_15 = "Кунг Лао";
    public static String HERO_NAME_16 = "Кэсси Кейдж";
    public static String HERO_NAME_17 = "Лю Кенг";
    public static String HERO_NAME_18 = "Милина";
    public static String HERO_NAME_19 = "Рейдэн";
    public static String HERO_NAME_20 = "Рептилия";
    public static String HERO_NAME_21 = "Саб-Зиро";
    public static String HERO_NAME_22 = "Скорпион";
    public static String HERO_NAME_23 = "Соня Блейд";
    public static String HERO_NAME_24 = "Такеда";
    public static String HERO_NAME_25 = "Таня";
    public static String HERO_NAME_26 = "Тремор";
    public static String HERO_NAME_27 = "Три-Борг";
    public static String HERO_NAME_28 = "Ферра";
    public static String HERO_NAME_29 = "Хищник";
    public static String HERO_NAME_30 = "Чужой";
    public static String HERO_NAME_31 = "Шиннок";
    public static String HERO_NAME_32 = "Эрмак";
    public static String HERO_NAME_33 = "Эррон Блэк";
    public static String HERO_DESC_1 = "Бо'Рай Чо — тучный мастер восточных единоборств с пристрастием к выпивке. Также он знаменит своими своеобразными приёмами, которые он использует во время боя (например, его рвёт под ноги противнику). " +
            "Его основной боевой стиль — это «Пьяный кулак». Несмотря на своё пьянство и тучную комплекцию, Бо'Рай Чо — очень сильный и ловкий воин. " +
            "Он умеет использовать своё состояние и комплекцию, чтобы получать преимущество в поединках. Также он склонен применять в боях необычные приёмы, типа рвоты под ноги противнику";
    public static String HERO_DESC_2 = "Горо является принцем подземного царства Куатан во Внешнем Мире, а также он один из самых сильных воинов своей расы. В начале он служил Шао Кану, но после поражения от Лю Кенга ушёл в изгнание. " +
            "Позже Горо вернулся, чтобы, наконец, наладить мирную жизнь во Внешнем Мире. В новой хронологии после победы Лю Кенга, он не уходит в изгнание, а остался при дворе Шао Кана в качестве его союзника до гнибели императора. " +
            "После он стал союзником Коталь Кана, а после перешёл на сторону Милины";
    public static String HERO_DESC_3 = "В оригинальной хронологии, майор вооруженных сил США Джексон Бриггз, вместе с остальными земными войнами отправился во Внешний Мир на турнир Шао Кана, чтобы спасти лейтенанта Соню Блейд. " +
            "После победы землян он пытался предупредить правительство США об угрозе из параллельного мира, но ему не поверили. " +
            "Для того, чтобы быть готовым к атаке извне, Джакс использовал новейшие технологии и вживил себе в руки имплантанты, став самым сильным человеком на Земле. " +
            "В новой хронологии Джакс вместе с Соней оказался на острове Шанг Цунга, где проводился турнир Смертельная Битва";
    public static String HERO_DESC_4 = "Знаменитый маньяк, главный злодей фильмов серии «Пятница, 13-е», маньяк-убийца, известный своими кровавыми способами расправ над жертвами. «Фирменное» орудие убийства — мачете. " +
            "Воплощён в виде живого мертвеца, носящего рубашку и брюки синеватого оттенка, и порванный комбенизон зеленоватого цвета. Носит на лице хоккейную маску. " +
            "Обладает большой физической силой и почти бессмертен";
    public static String HERO_DESC_5 = "Джеки является дочерью Джэксона \"Джакса\" Бриггса и его жены Вероники, а также подругой и коллегой Кэсси Кейдж. " +
            "Она входит в состав отряда под командованием Кэсси, вместе с Такедой Такахаши и Кунг Джином." +
            "Джеки Бриггс является олимпийской чемпионкой по кикбоксингу. Кроме этого, она имеет армейскую подготовку, благодаря службе в Отряде Особого Назначения";
    public static String HERO_DESC_6 = "Джонни Кейдж был приглашён на турнир Смертельная Битва как один из сильнейших бойцов Земли. " +
            "Пройдя через турнир, Джонни Кейдж понял всю важность своего владения восточными единоборствами, а также важность событий, в которые он случайно оказался вовлечён. " +
            "Впоследствии, он стал членом Отряда Особого Назначения и помог отразить нашествие армии Шиннока на Земное Царство, победив падшего страшего бога в бою. " +
            "Хотя на первый взгляд, кажется, что Джонни Кейдж очень самодовольный и эгоистичный человек, на самом деле он сильный и храбрый воин, который всегда сражается на стороне добра и справедливости. " +
            "Его легкомыслие скрывает характер настоящего бойца";
    public static String HERO_DESC_7 = "Ди'Вора принадлежит к расе, называемой Китинн, которая населяла островное царство Арнык. " +
            "Уединённая натура Китиннов означала, что объединённые усилия по защите царства были невозможны и оно было завоёвано Шао Каном и присоединено к Внешнему Миру";
    public static String HERO_DESC_8 = "Кано — член клана Чёрный Дракон, безжалостной преступной организации наёмников, занимающейся торговлей оружием и убийствами. " +
            "Из-за своей находчивости, коварства и умения выживать, Кано является более опасным противником, чем другие преступники. " +
            "Кроме того, он сочетает в себе черты трусливого помощника, психопата и ловкого полководца";
    public static String HERO_DESC_9 = "Несмотря на свою слепоту, Кенши обладает очень острыми чувствами и телекинезом, что позволяет ему сражаться на равных с обычными бойцами. " +
            "Также в бою Кенши помогает его меч, который содержит в себе души его предков. В оригинальной хронологии Кенши пошёл в Отряд Особого Назначения, чтобы найти Шанг Цунга, который был виновен в его слепоте. " +
            "В новой хронологии Кенши также стал частью Отряда Особого Назначения, чтобы сражаться с различными врагами Земного Царства, такими как Шиннок и клан Красный Дракон";
    public static String HERO_DESC_10 = "В оригинальной хронологии Китана была дочерью короля и королевы мира Эдении, но после того как их мир захватил император Внешнего Мира Шао Кан, он взял королеву Синдел себе в жёны, а Китану удочерил. " +
            "На протяжении многих тысяч лет Китана воспитывалась императором, которого считала своим настоящим отцом." +
            "В новой хронологии, Китана имеет схожую историю - она также воспитывалась Шао Каном с детства и считала его своим настоящим отцом." +
            "Китана была арестована и приговорена к казни, но Лю Кенгу удалось её спасти. Китана присоединилась к земным воинам и участвовала в борьбе против армии Шао Кана во время его вторжения на Землю";
    public static String HERO_DESC_11 = "Кожаное лицо является основным антагонистом серии фильма ужасов \"Техасская резня бензопилой\". Его прозвище происходит от его масок, сделанных из кожи с лиц жертв, которые были убиты либо им, либо его семьёй, Сойерами. " +
            "Кожаное лицо, как и его семья, является каннибалом. Он, как правило, один, похищает и убивает прохожих, в то время как его брат Дрейтон обрабатывает мясо Жертв и делает из него барбекю или чили";
    public static String HERO_DESC_12 = "Коталь Кан выглядит как огромный ацтекский воин с кожей, покрашенной в зелёный цвет. После свержения императрицы Милины, он становится императором Внешнего Мира." +
            "Коталь Кан принадлежит к расе Ош-текк, поэтому он значительно сильнее и выносливее обычных людей";
    public static String HERO_DESC_13 = "Куан Чи является одним из самых могущественных колдунов во вселенной Mortal Kombat и одним из основных злодеев серии. " +
            "Он носит статус свободно путешествующего колдуна, что значит, что он может беспрепятственно перемещаться между различными мирами, а самое главное, при этом его нельзя обнаружить. " +
            "Также он обладает способностями некроманта и умеет призывать духи мёртвых себе на помощь. Для достижения своих целей Куан Чи умеет одинаково хорошо использовать, как хитроумные многоходовые комбинации, так и грубую силу. " +
            "Он оппортунист и готов объединиться с кем угодно, если это поможет ему добиться его целей. Также Куан Чи примечателен своей безжалостностью и прагматизмом. " +
            "Из-за своей обманчивой и склонной к предательству натуре Куан Чи заработал множество врагов в различных мирах";
    public static String HERO_DESC_14 = "Кунг Джин является потомком Великого Кунг Лао и двоюродным братом Кунг Лао. Он входит в состав отряда Кэсси Кейдж, вместе с Такедой Такахаши и Джэки Бриггс. " +
            "Бывший вор, а ныне - шаолиньский монах, Кунг Джин сыграл большую роль в поражении Шиннока. " +
            "Хотя Кунг Джин является мастером рукопашного боя и обладает великолепной ловкостью и скоростью, он предпочтает использовать в боях уникальное оружие - лук, который также может использоваться как короткий посох. " +
            "Джин является отличным лучником и может посылать стрелы под разными углами";
    public static String HERO_DESC_15 = "Кунг Лао в обоих хронологиях является потомком шаолиньского воина Великого Кунг Лао, который на турнире Смертельная Битва смог победить Шанг Цунга. " +
            "Позднее Великий Кунг Лао был убит союзником Шанг Цунга — принцем шоканов Горо. Хотя он придерживался традиционных убеждений шаолиньских монахов и в целом не был сторонником насилия, " +
            "при необходимости Кунг Лао мог быть беспощадным воином, особенно если на кону стояла жизнь его друзей и свобода его мира. " +
            "Он мастерски владеет стилем Ушу. В отличие от Лю Кенга, который предпочитает использовать в бою энергию Чи, основным оружием Кунг Лао является его широкополая шляпа с острыми, как лезвия бритвы, краями";
    public static String HERO_DESC_16 = "Кэсси является дочерью Джонни Кейджа и Сони Блейд. Кэсси - лидер нового отряда, созданного Джонни Кейджем, " +
            "который решил, что необходимо собрать команду молодых воинов, которые со временем могли бы заменить постаревших защитников Земли. " +
            "Вместе с её командой, Кэсси отправляется во Внешний Мир, что выяснить действительно ли амулет Шиннока находится в руках свергнутой императрицы Милины";
    public static String HERO_DESC_17 = "Лю Кенг несколько раз спасал Землю, сначала от поражения в турнире Смертельная Битва, а позже от нашествия императора Внешнего Мира Шао Кана и пришествия из Преисподней падшего Старшего Бога Шиннока. " +
            "Позже Лю Кенг был убит колдунами Шанг Цунга и Куан Чи. Его тело было воскрешено Рейденом в качестве убийцы, а дух Лю Кенг помог спасти его друзей от чар Короля Драконов. " +
            "В новой хронологии серии Лю Кенг был случайно убит Рейденом, когда попытался пойти против его приказа. " +
            "После этого он был воскрешён Куан Чи в качестве одного из его слуг-ревенантов, а после смерти некроманта и поражения Шиннока занял место правителя Преисподней";
    public static String HERO_DESC_18 = "Милина является клоном Китаны, созданным колдуном Шанг Цунгом для императора Внешнего Мира Шао Кана. В ходе создания Милины, Шанг Цунг использовал кровь эденийки Китаны и кровь таркатанов — расы свирепых мутантов, живущих в пустошах Внешнего Мира. " +
            "При помощи крови таркатанов, колдун рассчитывал сделать Милину более лояльной императору, но его эксперимент не совсем удался — " +
            "в результате ошибки, лицо Милины было изуродованно и вместо нормального человеческого рта у неё оказалась огромная пасть, как у таркатана, усеянная большими и острыми зубами. " +
            "Милина очень зла и непредсказуема. Её уродство и наполовину таркатанское происхождение создали взрывоопасную комбинацию. Хитрая, расчётливая и всегда готовая нанести удар в спину своим союзникам, Милина, как и обычные таркатаны подвержена вспышкам неконтролируемой ярости и жестокости. " +
            "Вместе с её почти идеальной внешностью, не считая её нижней половины лица, Милина одновременно является красавицей и чудовищем. При этом Милина труслива и если враг сильнее её она, скорее всего, подчиниться его воле или сбежит. ";
    public static String HERO_DESC_19 = "Рейден известен под разными именами в разных религиях мира, но его суть почти всегда оставалась неизменной — мифический бог Грома. " +
            "Как и в случае с другими богами, рассказы о его приключениях были сильно изменены или неправильно поняты. " +
            "Его заданием всегда была защита Земного Царства от нападения существ вроде Шао Кана, Шиннока или Онаги. " +
            "Хотя он может лично вмешиваться, когда Земле угрожает опасность, он не может напрямую влиять на судьбы людей. " +
            "Рейден может только подсказать им правильный путь, но выбор своей судьбы всегда остаётся за самим человеком";
    public static String HERO_DESC_20 = "Рептилия — представитель расы Зауриан, человекоподобных разумных ящеров. Его родной мир, Затерра, был захвачен Шао Каном, а большинство представителей его расы уничтожено. " +
            "На протяжении всех игр серии Рептилия пытается добиться воскрешения своей расы тем или иным способом. " +
            "По характеру Рептилия импульсивен и подвержен вспышкам ярости. Он одержим идеей воскрешения своей расы, и готов пойти на любое преступление, чтобы добиться этого. " +
            "Также, он очень подвержен влиянию других людей";
    public static String HERO_DESC_21 = "Настоящее имя - Куай Лиэнг. Имя \"Саб-Зиро\" является своеобразным титулом-именем, которое передаётся от одного члена семьи к другому, как правило, после гибели предыдущего его обладателя. " +
            "Являясь потомком расы криомантов из Внешнего Мира, Саб-Зиро обладает врождённой способностью контролировать лёд в разных его проявлениях. " +
            "Саб-Зиро умеет замораживать противника, бросив в него ледяной шар, также он может просто приморозить ноги противника к земле или создать под его ногами лёд, чтобы враг терял равновесие. " +
            "Кроме того Саб-Зиро умеет мгновенно создавать ледяные статуи, которые замораживают врага, если тот к ним прикоснётся. " +
            "После возвращения к форме человека, и получения лидерства над Лин Куэй, Саб-Зиро улучшил свои способности к созданию ледяных оружий и научился создавать различные орудия изо льда, такие как кинжалы, мечи, молоты. " +
            "Также он научился использовать криомантию для защиты, создавая ледяной панцирь вокруг себя и ледяные стены, отгараживающие его от атак";
    public static String HERO_DESC_22 = "Настоящее имя Скорпиона - Ханзо Хасаши и он является членом клана Ширай Рю. В оригинальной хронологии, он был убит старшим из братьев Саб-Зиро, Би-Ханом. " +
            "После перерождения в Преисподней, Скорпион два года преследовал Саб-Зиро, пока наконец не смог его убить после окончания десятого турнира Смертельной Битвы. " +
            "В новой хронологии Скорпион также был убит Би-Ханом и воскрешён Куан Чи. Ему удалось отомстить своему убийце, уничтожив, Саб-Зиро старшего на первом турнире. " +
            "Позже, Скорпион принимал участие во вторжении сил Преисподней на Землю, на стороне Куан Чи. Несколько лет спустя, он, вместе с Саб-Зиро и Джаксом был освобождён от проклятье Куан Чи и снова стал человеком";
    public static String HERO_DESC_23 = "Соня Блейд — лейтенант Отряда особого назначения армии США, и позже, основатель Агентства по Исследованию Внешнего Мира. " +
            "Хотя Соня может показаться грубой и недружелюбной, но на самом деле, она сильно заботиться о своих друзьях и союзниках. " +
            "Соня готова идти на риск, если это позволит ей добиться желаемого результата. Она случайно стала участницей десятого турнира Смертельная Битва, оказавшись на острове Шанг Цунга во время погони за Кано";
    public static String HERO_DESC_24 = "Такеда - Член клана Ширай Рю, сын Кенши и Сучин и воспитанник Ханзо Хасаши. Подготовкой Такеды занимались Скорпион и Кенши, а потому Такеда обладает сразу навыками ниндзя Ширай Рю и умениями мечника. " +
            "Его стандартным оружием являются два механических хлыста, которые Такеда может использовать для рубящих ударов и притягивания противника. " +
            "Кроме того, Такеда может использовать телекинетические способности для телепортации и манипулирования мечами";
    public static String HERO_DESC_25 = "Таня является дочерью посла Эдении в других мирах. В своих действиях Таня руководствуется исключительно инстинктом самосохранения и оправдывает свои действия тем, что это «правильные решения» в данной ситуации. " +
            "Она оппортунистка, готовая помогать любому, кто гарантирует ей безопасность и, возможно, власть. Также она гордится своими познаниями в области дипломатии и магии. " +
            "Таня - очень быстрый и ловкий противник. В бою она использует различные акробатические приёмы и умеет использовать свою скорость и гибкость, чтобы неожиданно атаковать своего противника. " +
            "Также она обладает познаниями в области магии, что позволяет ей использовать в бою магические снаряды и телепортироваться. Она отлично обращается с двумя видами оружия: тонфа и нагинатой";
    public static String HERO_DESC_26 = "Тремор являлся членом банды Чёрный Дракон. В оригинальной хронологии он был, видимо, убит Джаксом, во время событий связанных с побегом и охотой на Кано. " +
            "В новой хронологии Тремор добыл \"психо-бомбу\", которую Кано использовал, чтобы достать амулет Шиннока. Для этого ему пришлось пройти через Царство Снов. " +
            "Пребывание в этом мире трансформировало Тремора из человека в элементаля, который обладает полным контролем над элементом земли и, заодно, рассорило его с Кано и Чёрным Драконом";
    public static String HERO_DESC_27 = "У Триборга - четыре вариации, которые имитируют четырёх различных киборгов: Сектора, Сайракса, Смоука и Кибер Саб-Зиро. " +
            "риборг, будучи киборгом, быстрее и сильнее любого человека. Но его основная сила в умении использовать боевые стили различных воинов, которые хранятся в его памяти. " +
            "Он может переключаться между стилями, как минимум четырёх воинов: Сектора, Сайракса, Смоука и Кибер Саб-Зиро. " +
            "Во время использования боевых навыков одного из воинов, он не только получает их приёмы, но также и их оружие, что делает его крайне опасным противником";
    public static String HERO_DESC_28 = "Ферра и Торр представители неизвестной симбиотической расы. Ферра является карлицей, командующая огромным воином по имени Торр. " +
            "Кроме того, что Ферра служит Торру \"наездником\" и отдаёт приказы, он может использовать её, в качестве оружия";
    public static String HERO_DESC_29 = "Хищник не хочет управлять нами. Он не желает уничтожить все миры. Он и другие представители его расы дерутся и убивают лишь из спортивного интереса. В земном Царстве было много битв. " +
            "Шао Кан, а затем и Шиннок считали себя завоевателями. Они были разбиты. Хищник не будет. Люди, внешнемирцы и демоны Преисподней падут перед его оружием и силой. " +
            "Их шкуры станут прекрасными трофеями";
    public static String HERO_DESC_30 = "Ксеноморфы пришли во Внешний Мир давно, но оставленные ими яйца были обнаружены совсем недавно. Лидер таркатанского патруля поднял странный кожистый шар, и вдруг из шара выпрыгнуло нечто и прикрепилось к его лицу. " +
            "Позже, когда лицехват отвалился, детеныш Чужого вырвался из груди несчастного таркатанца, неся в себе характеристики как Ксеноморфа, так и хозяина. " +
            "Он отделился от остальных таркатанов и в итоге убил их всех. Сейчас он скитается по Внешнему Миру, ища новых хозяев. Его удивительная сила и животная ярость делают Чужого практически непобедимым";
    public static String HERO_DESC_31 = "Шиннок — могущественный и мстительный падший старший бог. Когда он пытался уничтожить остальных старших богов, он проиграл и был заточён в Преисподней, которую он чуть позже смог покорить. " +
            "В отличие от Шао Кана, Шиннок больше рассчитывает не на грубую силу и устрашение, а на магию и хитрые многоходовые планы. " +
            "Будучи по происхождению старшим богом, Шиннок обладает знаниями и опытом многих тысячелетий";
    public static String HERO_DESC_32 = "Эрмак обладает способностями к телекинезу и левитации. Он создан из душ воинов, убитых Шао Каном, и из-за чёрной магии императора вынужден работать на него. " +
            "Эрмак создан из душ убитых эденийцев, которые пытались освободить свой мир, Эдению, от власти Кана. Среди этих душ есть и душа короля Эдении, Джеррода. " +
            "В оригинальной хронологии Эрмак был освобождён от контроля Шао Кана слепым мечником Кенши. Получив свободу, Эрмак решил искупить свои прошлые грехи и встал на сторону воинов Света. " +
            "В новой хронологии, после гибели Шао Кана, Эрмак стал сначала стал служить его приёмной дочери Милине, а после - новому императору Внешнего Мира, Коталь Кану";
    public static String HERO_DESC_33 = "Эррон является наёмником нового императора Внешнего Мира Коталь Кана, от имени которого он ведёт переговоры с кланом Чёрного Дракона о поставках оружия. " +
            "Внешне Эррон выглядит, как классический ковбой. Единственное его отличие от традиционного образа - это маска на лице, которая похожа на маски, которые носят ниндзя";
}